{
  "about_main": {
    "header": {
      "en": "About Me",
      "is": "Um Mig"
    },
    "text": [
      {
        "en": "From an early age, I was interested in computers and technology. As a curious child, I would take apart my family's old Windows 95 desktop at home to try to find out how it works. This obviously, yielded no results as one can only gain so much knowledge by looking at motherboards and components of a computer. Regardless, this continued throughout the years as I was simply fascinated with them.",
        "is": "Frá ungum aldri hafði ég áhuga á tölvum og tækni. Sem forvitið barn tók ég í sundur gömlu Windows 95 borðtölvu fjölskyldu minnar heima til að reyna að komast að því hvernig hún virkaði. Þetta skilaði augljóslega engum árangri þar sem maður getur aðeins öðlast svo mikla þekkingu með því að skoða móðurborð og íhluti tölvu. Engu að síður hélt þetta áfram í gegnum árin þar sem ég var einfaldlega heillaður af þeim."
      },
      {
        "en": "My knowledge of computers grew with time as I would read articles and watch videos describing the newest technologies and features in new computer hardware which resulted in me being the person people went to when they had some problems with their computer, and in being asked which computer they should get or which parts were the best for their new build.",
        "is": "Þekking mín á tölvum jókst með tímanum þar sem ég las greinar og horfði á myndbönd sem lýstu nýjustu tækni og eiginleikum í nýjum tölvubúnaði sem leiddi til þess að ég var sá sem fólk leitaði til þegar það átti í vandræðum með tölvuna sína og að ég var spurður hvaða tölvu þau ættu að fá eða hvaða íhlutir voru bestir fyrir nýju tölvuna þeirra. "
      },
      {
        "en": "I always knew I wanted to study and learn something related to computers and technology. However, my interest in software only emerged when I attended basic programming courses in high school which taught me the basics of programming and of the programming language python. This opened my eyes to the beauty and elegance of being able to make computers do whatever I wanted.",
        "is": "Ég vissi alltaf að mig langaði að læra eitthvað sem tengist tölvum og tækni. Hugbúnaðaráhuginn minn kom þó fyrst fram þegar ég tók grunnforritunarnámskeið í menntaskóla sem kenndi mér grunnatriði forritunar og forritunarmálsins python. Þetta opnaði augu mín fyrir fegurð og glsileika þess að geta látið tölvu gera það sem ég vil."
      },
      {
        "en": "Three years ago, I was lucky enough to be able to attend the University of Iceland to study Computer Science. The journey wasn’t easy, having struggled a bit working during my studies, and experiencing a global pandemic halfway through university. I have persevered and achieved one of my dreams and finished my Computer Science degree! Now as a freshly graduated Computer Scientist, I am now ready to enter the job market!",
        "is": "Fyrir þremur árum var ég svo heppin að geta farið í Háskóla Íslands og lært Tölvunarfræði. Ferðalagið var ekki auðvelt, eftir að hafa átt í erfiðleikum með að vinna með náminu og upplifa heimsfaraldur hálfa leiðina gegnum háskólanámið. Ég hef þraukað og náð einum af draumum mínum og klárað Tölvunarfræðigráðuna! Nú sem nýútskrifaður Tölvunarfræðingur er ég tilbúinn að fara út á vinnumarkaðinn!"
      }
    ]
  }
}