{
  "jobsTitle": {
    "en": "Job Experience",
    "is": "Starfsreynsla"
  },
  "jobs": [
    {
      "company": {
        "en": "Rapyd (Valitor)",
        "is": "Rapyd (Valitor)"
      },
      "title": {
        "en": "Software Developer",
        "is": "Forritari"
      },
      "description": {
        "en": "Software Developer working on payment card Issuing solutions. Currently developing scalable backend systems for authorizing and clearing Visa and MasterCard card payments.",
        "is": "Forritari starfandi við þróun á útgáfulausnum greiðslukorta. Vinn að þróun skalanlega bakendakerfa fyrir heimildaveitingu og færsluvísun Visa og MasterCard greiðslukorta."
      },
      "time": [ 2022 ],
      "current": true
    },
    {
      "company": {
        "en": "Icelandic Red Cross",
        "is": "Rauði Kross Íslands"
      },
      "title": {
        "en": "General Quarantine Hotel Employee",
        "is": "Almennur Starfsmaður á Farsóttarhúsi"
      },
      "description": {
        "en": "Provided care and services to individuals in quarantine and isolation in isolation facilities who couldn't safely quarantine or isolate themselves at their place of residence and those without permanent residence in the country.",
        "is": "Sinnti einstaklingum í sóttkví og einangrun á farsóttarhúsum sem gátu ekki sinnt sóttkví eða einangrun í sínu heimahúsi og þeim sem ekki höfðu fasta búsetu á landinu."
      },
      "time": [ 2021, 2022 ],
      "current": false
    },
    {
      "company": "Sæplast Iceland",
      "title": {
        "en": "Data Analysis - Summer Intern",
        "is": "Gagnagreining - Sumarstarf"
      },
      "description": {
        "en": "Designed, implemented and deployed a system used to log and analyse random production sample data for Sæplast's manufacturing plant in Dalvík.",
        "is": "Hannaði, innleiddi og setti upp kerfi notað til að skrá og greina gögn um slembin framleiðslusýni fyrir verksmiðju Sæplasts á Dalvík."
      },
      "time": [ 2021 ],
      "current": false
    },
    {
      "company": "Íslenska Flatbakan",
      "title": {
        "en": "Pizzabaker, Waiter & Cashier",
        "is": "Pizzubakari, Þjónn & Afgreiðslumaður"
      },
      "description": {
        "en": "Performed almost all possible tasks; everything from waiting tables, servicing customers and baking pizzas to prepping and cleaning.",
        "is": "Sinnti nær öllum mögulegum hlutverkum á staðnum; allt frá því að þjóna til borðs, afgreiðslu og pizzabaksturs til undirbúnings og þrifs."
      },
      "time": [ 2019, 2021 ],
      "current": false
    },
    {
      "company": {
        "en": "Kópavogur Municipality",
        "is": "Kópavogsbær"
      },
      "title": {
        "en": "Work School Team Leader",
        "is": "Flokkstjóri Vinnuskólans"
      },
      "description": {
        "en": "Was primarily a substitute team leader, took over other team leader's groups when they got sick or went on holiday. While few or no team leaders were unavailable I worked on other projects for the municipality.",
        "is": "Vann aðallega við afleysingar þar sem ég tók við hópum þeirra vaktstjóra sem voru veikir eða í fríi. Þegar ekki þurfti afleysingar, sinnti ég öðrum verkefnum fyrir bæjarfélagið"
      },
      "time": [ 2019 ],
      "current": false
    }
  ]
}