{
  "jobsTitle": {
    "en": "Job Experience",
    "is": "Starfsreynsla"
  },
  "jobs": [
    {
      "company": {
        "en": "Valitor",
        "is": "Valitor"
      },
      "title": {
        "en": "Software Developer",
        "is": "Forritari"
      },
      "description": {
        "en": "I began work at Valitor shortly after graduation in March 2022 as a Software Developer in the Issuing department. My main project since i began working here has been rewriting the company's Visa and MasterCard authorization systems from COBOL to C#. I have personally been involved in designing, developing, testing and implementing these systems and have gained a lot of knowledge since I began here.",
        "is": "Ég hóf störf hjá Valitor stuttu eftir útskrift í mars 2022 sem Forritari á kortautgáfusviði. Aðal verkefnið mitt frá því að ég hóf störf hefur verið að vinna að endurskrift Visa og MasterCard heimildakerfa fyrirtækisins úr COBOL í C#. Ég hef persónulega tekið þátt í hönnun, þróun, prófun og innleiðingu þessara kerfa og hef ég því öðlast mikla þekkingu síðan ég byrjaði hér."
      },
      "time": [ 2022 ],
      "current": true
    },
    {
      "company": {
        "en": "Icelandic Red Cross",
        "is": "Rauði Kross Íslands"
      },
      "title": {
        "en": "General Quarantine Hotel Employee",
        "is": "Almennur Starfsmaður á Farsóttarhúsi"
      },
      "description": {
        "en": "Provided care and services to individuals in quarantine and isolation in quarantine hotels who couldn't safely quarantine or isolate themselves at their place of residence and those without permanent residence in the country.",
        "is": "Sinnti einstaklingum í sóttkví og einangrun á farsóttarhúsum sem gátu ekki sinnt sóttkví eða einangrun í sínu heimahúsi og þeim sem ekki höfðu fasta búsetu á landinu."
      },
      "time": [ 2021, 2022 ],
      "current": false
    },
    {
      "company": "Sæplast Iceland",
      "title": {
        "en": "Data Analysis - Summer Intern",
        "is": "Gagnagreining - Sumarstarf"
      },
      "description": {
        "en": "Designed, implemented and deployed a system used to log and analyse random production sample data for Sæplast's manufacturing plant in Dalvík.",
        "is": "Hannaði, innleiddi og setti upp kerfi notað til að skrá og greina gögn um slembin framleiðslusýni fyrir verksmiðju Sæplasts á Dalvík."
      },
      "time": [ 2021 ],
      "current": false
    },
    {
      "company": "Íslenska Flatbakan",
      "title": {
        "en": "Pizzabaker, Waiter & Cashier",
        "is": "Pizzubakari, Þjónn & Afgreiðslumaður"
      },
      "description": {
        "en": "Performed almost all possible tasks; everything from waiting tables, servicing customers and baking pizzas to prepping and cleaning.",
        "is": "Sinnti nær öllum mögulegum hlutverkum á staðnum; allt frá því að þjóna til borðs, afgreiðslu og pizzabaksturs til undirbúnings og þrifs."
      },
      "time": [ 2019, 2021 ],
      "current": false
    },
    {
      "company": {
        "en": "Kópavogur Municipality",
        "is": "Kópavogsbær"
      },
      "title": {
        "en": "Work School Team Leader",
        "is": "Flokkstjóri Vinnuskólans"
      },
      "description": {
        "en": "Was primarily a substitute team leader, took over other team leader's groups when they got sick or went on holiday. While few or no team leaders were unavailable I worked on other projects for the municipality.",
        "is": "Vann aðallega við afleysingar þar sem ég tók við hópum þeirra vaktstjóra sem voru veikir eða í fríi. Þegar ekki þurfti afleysingar, sinnti ég öðrum verkefnum fyrir bæjarfélagið"
      },
      "time": [ 2019 ],
      "current": false
    },
    {
      "company": "Vestfiskur",
      "title": {
        "en": "Factory Labourer",
        "is": "Starfsmaður í Framleiðslu"
      },
      "description": {
        "en": "Worked on manufacturing high-quality dried fish products. Was involved in the entire process; from the receipt of raw materials and products, through production to packaging and preparation of shipments.",
        "is": "Vann við framleiðslu á hágæða harðfisk, en þar fékk ég tækifæri á að sinna öllum störfum sem fylgdu ferlinu, svo sem móttöku hráefna, framleiðslu, pökkun og undirbúnings sendingina."
      },
      "time": [ 2015, 2018 ],
      "current": false
    }
  ]
}